/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   rot_13_2.c                                         :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: kakim <marvin@42.fr>                       +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2018/01/26 04:21:00 by kakim             #+#    #+#             */
/*   Updated: 2018/01/26 04:45:42 by kakim            ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include <unistd.h>
#include <stdlib.h>

void	rot_13(char *str)
{
	int i;
	int j;
	
	i = 0;
	j = 0;
	while (str[i] != '\0')
	{
		if(str[i] >= 'A' && str[i] <= 'Z')
		{
			str[i] = ((str[i] + 52) % 26) + 65;
			i++;
		}
		if(str[i] >= 'a' && str[i] <= 'z')
		{	
			str[i] = ((str[i] - 84) % 26) + 97;
			i++;
		}
		else
			i++;
	}
	while (str[j] != '\0')
	{
		write(1, &str[j], 1);
		j++;
	}
}

int		main(int ac, char **av)
{
	if (ac == 2)
		rot_13(av[1]);
	write(1, "\n", 1);
	return (0);
}

/*
abcdefghijklmnopqrstuvwxyz
01234567890123456789012345
a + 13 % 26 --> 0 + 13 % 26 = 13 -> n
j + 13 % 26 --> 9 + 13 % 26 = 22 -> w 
p + 13 % 26 --> 15 + 13 % 26 = 2 -> b
z + 13 % 26 --> 25 + 13 % 26 = 38 - 26 = 12 -> m
끝나면 다시 원래 위치로 숫자 더해주기!!!!

*/